// pages/discovery/discovery.js
Page({
  data: {
    array: [
      {
      name: "谢树成教授荣获首届全国创新争先奖",
      time: "2017-6-1"
      },
      {"name": "话剧《大地之光》在渝演出受到10余家媒体关注", "time": "2017-5-31", },
      { "name": "话剧《大地之光》感动山城重庆", "time": "2017-5-28", },
      { "name": "校领导率队赴竹山县开展扶贫工作", "time": "2017-5-27", },
      { "name": "两专业接受工程教育专业联合认证专家现场考查", "time": "2017-5-27", },
      { "name": "“青春喜迎十九大，不忘初心跟党走”专题团会举行", "time": "2017-5-25", },
      { "name": "学校召开2017年纪检监察干部培训会", "time": "2017-5-25", },
      { "name": "逸夫博物馆参加“湖北省科技活动周”科普展台", "time": "2017-5-25", },
      { "name": "2017年土地科技活动周启动", "time": "2017-5-25", },
      { "name": "研究生教育国际化：服务国家战略", "time": "助力“双一流”建设", "undefined": "2017-5-24", },
      { "name": "我校在“克拉通岩石圈减薄”方向研究中取得新进展", "time": "2017-5-24", },
      { "name": "著名声乐教育家郭淑珍来校交流", "time": "2017-5-24", },
      { "name": "资源勘查工程专业：志存高远谋发展", "time": "2017-5-24", },
      { "name": "精准发力", "time": "培养一流工程人才", "undefined": "2017-5-23" }
    ]
  },
  onShow:function(){
  },
  onPullDownRefresh: function () {
    var that = this;
    that.onShow();
  }
})